{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.9", "config": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "use_bias": true, "filters": 32, "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "activity_regularizer": null, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 3, 28, 28], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "activation": "relu", "padding": "same", "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "use_bias": true, "filters": 32, "dilation_rate": [1, 1], "trainable": true, "padding": "valid", "activity_regularizer": null, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_first", "padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.2}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "use_bias": true, "filters": 64, "dilation_rate": [1, 1], "trainable": true, "padding": "same", "activity_regularizer": null, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "use_bias": true, "filters": 64, "dilation_rate": [1, 1], "trainable": true, "padding": "valid", "activity_regularizer": null, "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_first", "padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_2", "seed": null, "rate": 0.2}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "use_bias": true, "filters": 128, "dilation_rate": [1, 1], "trainable": true, "padding": "same", "activity_regularizer": null, "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "use_bias": true, "filters": 128, "dilation_rate": [1, 1], "trainable": true, "padding": "valid", "activity_regularizer": null, "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_first", "padding": "valid", "name": "max_pooling2d_3", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_3", "seed": null, "rate": 0.2}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "activation": "relu", "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "units": 512, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_4", "seed": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "activation": "softmax", "activity_regularizer": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "units": 36, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}}]}